/*  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
.                                                                             .
.    (c) 2000-2011 Scalado AB. All rights reserved.                           .
.                                                                             .
.    Technologies used in this source code are patented or patent pending     .
.    by Scalado AB Swedish Org. Number, 556594-6885.                          .
.                                                                             .
.    All Intellectual Property Rights related to this source code,            .
.    belongs to Scalado AB.                                                   .
.                                                                             .
.    This source code is furnished under license agreement and may be used    .
.    or copied only in accordance with terms of such license agreement.       .
.                                                                             .
.    Except as permitted by such license agreement, no part of this source    .
.    code may be reproduced, stored in a retrieval system, or transmitted,    .
.    in any form or by any means, electronic, mechanical, recording, or       .
.    otherwise, without the prior written permission of Scalado.              .
.                                                                             .

.    Scalado and the Scalado logo are either registered trademarks or         .
.    trademarks of Scalado AB in Sweden and/or other countries.               .
.                                                                             .
. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .*/

#ifndef SCBDEFS_H
#define SCBDEFS_H

#ifdef __cplusplus
extern "C" {
#endif

#define IS_ALIGNED(p, a) ((((CTuint32) p) & ((a) - 1)) == 0)

#if defined(_MSC_VER) && defined(SCB_DBGMODE_MEMORY)
// put all const data into .rdata$<x> so that
// we can find the segment for debugging purposes.
#pragma const_seg(".rdata$dbgmda_consts")
#define SCB_DBGMDA_CONSTS_SEGMENT_IS_ON
#endif

/* A compile-time static assert */
#define SCB_STATIC_ASSERT(expression) \
    extern char _static_assert[(expression)?1:-1]


#define SCB_REVISION_STR _SD("$Rev$")
#ifndef WIN32 
#if (__STDC_VERSION__ >= 199901L)
#define SCB_C99
#endif
#endif


//=============================================================================
/**
    @ingroup types_n_defs
    @file scbdefs.h
    @brief Defines public symbols, macros and types.
*/
//=============================================================================
/**
    @addtogroup types_n_defs
    @brief Defines public symbols, macros and types.

    @par Naming conventions
    Type names are always prefixed with @c CT. Following the @c CT prefix is
    always the specifier of the type. If the first letter of the type
    specifier is lower case it signifies that it's primitive (e.g @c CTint) and
    upper case that it's complex (e.g @c CTRect).

    @par Visibility
    Complex types are always public within this header as it by definition
    doesn't require linkage.

    @{
*/
//-----------------------------------------------------------------------------

/**
    @name Primitive data types
*/
// @{
typedef signed char         CTint8;         ///< 8 bit signed integer
typedef unsigned char       CTuint8;        ///< 8 bit unsigned integer

typedef short               CTint16;        ///< 16 bit signed integer
typedef unsigned short      CTuint16;       ///< 16 bit unsigned integer

#ifdef __LP64__
    /* Support for GCC 64 bit targets where long int and pointer 
       both use 64-bits and int uses 32-bit. */
    typedef int             CTint32;        ///< 32 bit signed integer
    typedef unsigned int    CTuint32;       ///< 32 bit unsigned integer

#else
    typedef long            CTint32;        ///< 32 bit signed integer
    typedef unsigned long   CTuint32;       ///< 32 bit unsigned integer

#endif


typedef float               CTfloat;        ///< Float
typedef double              CTdouble;       ///< Double
typedef unsigned char       CTbyte;         ///< Unsigned char
typedef char                CTchar;         ///< Char
// @}
//-----------------------------------------------------------------------------

/**
    @brief 64 bit unsigned integer representation.
*/
typedef struct CTuint64
{
    CTuint32    low;    ///< Least significant bits.
    CTuint32    high;   ///< Most significant bits.
}CTuint64;

/**
    @brief 128 bit unsigned integer representation.
*/
typedef CTuint8 CTuint128[16];

/**
    @brief Unsigned rational representation.
*/
typedef struct CTRational
{
    CTuint32 numerator;     ///< Numerator.
    CTuint32 denominator;   ///< Denominator.
} CTRational;

/**
    @brief Signed rational representation.
*/
typedef struct CTSRational
{
    CTint32 numerator;      ///< Numerator.
    CTint32 denominator;    ///< Denominator.
} CTSRational;

#if !defined( __MARM__ )
    typedef unsigned short  CTwchar;
#else
    typedef unsigned short  CTwchar;
#endif


#define SCB_MAXPATH         260


// Make sure primitive types have valid sizes.

SCB_STATIC_ASSERT( sizeof( CTchar ) == 1 );
SCB_STATIC_ASSERT( sizeof( CTbyte ) == 1 );
SCB_STATIC_ASSERT( sizeof( CTint8 ) == 1 );
SCB_STATIC_ASSERT( sizeof( CTint16 ) == 2 );
SCB_STATIC_ASSERT( sizeof( CTint32 ) == 4 );
SCB_STATIC_ASSERT( sizeof( CTuint8 ) == 1 );
SCB_STATIC_ASSERT( sizeof( CTuint16 ) == 2 );
SCB_STATIC_ASSERT( sizeof( CTuint32 ) == 4 );

typedef CTuint32 CTbool;    ///< Boolean (true/false).

#ifndef __cplusplus
    #define true  1
    #define false 0
#endif


//  -  Byte order (endian) configuration.
#define SCB_LITTLE_ENDIAN   1
#define SCB_BIG_ENDIAN      2

#if defined( BYTE_ORDER_LITTLE_ENDIAN )
    #define SCB_BYTE_ORDER SCB_LITTLE_ENDIAN
#elif defined( BYTE_ORDER_BIG_ENDIAN )
    #define SCB_BYTE_ORDER SCB_BIG_ENDIAN
#elif defined( __BIG_ENDIAN )
    #define SCB_BYTE_ORDER SCB_BIG_ENDIAN
#else // None specified, default to little endian.
#if defined(_MSC_VER)
    #pragma message("**WARNING, no byte order specified on build commandline, defaulting to SCB_LITTLE_ENDIAN.")
#endif
    #define SCB_BYTE_ORDER SCB_LITTLE_ENDIAN
#endif

// Just to make sure..
#ifndef SCB_BYTE_ORDER
    #error No byte order configured!
#endif

//-----------------------------------------------------------------------------
/**
